Revit 2027 API
SphericalLightDistribution(SphericalLightDistribution) Constructor
 Creates a copy of the given spherical light distribution
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SphericalLightDistribution(
	SphericalLightDistribution other
)
Public Sub New (
	other As SphericalLightDistribution
)
public:
SphericalLightDistribution(
	SphericalLightDistribution^ other
)
new :
        other : SphericalLightDistribution -> SphericalLightDistribution
Parameters
other SphericalLightDistribution
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SphericalLightDistribution Class
SphericalLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace